CatRovacer/vario_mk/_varlib/add2Adafruit-hardware-nrf52/boards.txt
Generic_nRF51822.menu.softdevice.s130=S130
Generic_nRF51822.menu.softdevice.s130.softdevice=s130
Generic_nRF51822.menu.softdevice.s130.softdeviceversion=2.0.1
Generic_nRF51822.menu.softdevice.s130.upload.maximum_size=151552
Generic_nRF51822.menu.softdevice.s130.build.extra_flags=-DNRF51 -DS130 -DNRF51_S130
Generic_nRF51822.menu.softdevice.s130.build.ldscript=armgcc_s130_nrf51822_{build.chip}.ld

Generic_nRF51822.menu.lfclk.lfxo=Crystal Oscillator
Generic_nRF51822.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
Generic_nRF51822.menu.lfclk.lfrc=RC Oscillator
Generic_nRF51822.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
Generic_nRF51822.menu.lfclk.lfsynt=Synthesized
Generic_nRF51822.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT


#######
# -----------------------------------
# Nordic nRF51822 
# -----------------------------------
GenRF51822.name=Generic exNordic nRF51822

GenRF51822.vid.0=0x0d28
GenRF51822.pid.0=0x0204

GenRF51822.upload.tool=openocd
GenRF51822.upload.protocol=cmsis-dap
GenRF51822.upload.target=nrf51
GenRF51822.upload.maximum_size=262144
GenRF51822.upload.setup_command=transport select swd;
GenRF51822.upload.use_1200bps_touch=false
GenRF51822.upload.wait_for_upload_port=false
GenRF51822.upload.native_usb=false

GenRF51822.bootloader.tool=openocd

GenRF51822.build.mcu=cortex-m0
GenRF51822.build.f_cpu=16000000
GenRF51822.build.board=CALLIOPE_MINI
GenRF51822.build.core=nRF5
GenRF51822.build.variant=GenRF51822
GenRF51822.build.variant_system_lib=
GenRF51822.build.extra_flags=-DNRF51
GenRF51822.build.float_flags=
GenRF51822.build.ldscript=nrf51_xxaa.ld

GenRF51822.build.lfclk_flags=-DUSE_LFRC

GenRF51822.menu.softdevice.none=None
GenRF51822.menu.softdevice.none.softdevice=none
GenRF51822.menu.softdevice.none.softdeviceversion=

GenRF51822.menu.softdevice.s110=S110
GenRF51822.menu.softdevice.s110.softdevice=s110
GenRF51822.menu.softdevice.s110.softdeviceversion=8.0.0
GenRF51822.menu.softdevice.s110.upload.maximum_size=151552
GenRF51822.menu.softdevice.s110.build.extra_flags=-DNRF51 -DS110 -DNRF51_S110
GenRF51822.menu.softdevice.s110.build.ldscript=armgcc_s110_nrf51822_xxaa.ld

GenRF51822.menu.softdevice.s130=S130
GenRF51822.menu.softdevice.s130.softdevice=s130
GenRF51822.menu.softdevice.s130.softdeviceversion=2.0.1
GenRF51822.menu.softdevice.s130.upload.maximum_size=151552
GenRF51822.menu.softdevice.s130.build.extra_flags=-DNRF51 -DS130 -DNRF51_S130
GenRF51822.menu.softdevice.s130.build.ldscript=armgcc_s130_nrf51822_xxaa.ld

#======
# -----------------------------------
# Adafruit Feather nRF52832
# -----------------------------------
GenRF52832.name=Generic nRF52832

# Upload
GenRF52832.upload.tool=openocd
GenRF52832.upload.protocol=cmsis-dap
GenRF52832.upload.target=nrf51
GenRF52832.upload.maximum_size=262144
GenRF52832.upload.setup_command=transport select swd;
GenRF52832.upload.use_1200bps_touch=false
GenRF52832.upload.wait_for_upload_port=false
GenRF52832.upload.native_usb=false

GenRF51822.bootloader.tool=openocd


GenRF52832.bootloader.tool=bootburn
GenRF52832.upload.tool=nrfutil
GenRF52832.upload.protocol=nrfutil
GenRF52832.upload.use_1200bps_touch=false
GenRF52832.upload.wait_for_upload_port=false
GenRF52832.upload.native_usb=false
GenRF52832.upload.maximum_size=290816
GenRF52832.upload.maximum_data_size=51712

# Build
GenRF52832.build.mcu=cortex-m4
GenRF52832.build.f_cpu=64000000
GenRF52832.build.board=NRF52832_FEATHER
GenRF52832.build.core=nRF5
GenRF52832.build.variant=feather_nrf52832
GenRF52832.build.usb_manufacturer="GENERIC"
GenRF52832.build.usb_product=
GenRF52832.build.extra_flags=-DNRF52832_XXAA -DNRF52
GenRF52832.build.ldscript=nrf52832_s132_v6.ld
GenRF52832.build.openocdscript=scripts/openocd/daplink_nrf52.cfg

# Menu: SoftDevice
GenRF52832.menu.softdevice.none=None
GenRF52832.menu.softdevice.none.softdevice=none
GenRF52832.menu.softdevice.none.softdeviceversion=

GenRF52832.menu.softdevice.s132v6=S132 6.1.1
GenRF52832.menu.softdevice.s132v6.build.sd_name=s132
GenRF52832.menu.softdevice.s132v6.build.sd_version=6.1.1
GenRF52832.menu.softdevice.s132v6.build.sd_fwid=0x00B7


# Menu: Debug Level
GenRF52832.menu.debug.l0=Level 0 (Release)
GenRF52832.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
GenRF52832.menu.debug.l1=Level 1 (Error Message)
GenRF52832.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
GenRF52832.menu.debug.l2=Level 2 (Full Debug)
GenRF52832.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
GenRF52832.menu.debug.l3=Level 3 (Segger SystemView)
GenRF52832.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
GenRF52832.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# Menu: Debug Port
GenRF52832.menu.debug_output.serial=Serial
GenRF52832.menu.debug_output.serial.build.logger_flags=-DCFG_LOGGER=0
GenRF52832.menu.debug_output.serial1=Serial1
GenRF52832.menu.debug_output.serial1.build.logger_flags=-DCFG_LOGGER=1 -DCFG_TUSB_DEBUG=CFG_DEBUG
GenRF52832.menu.debug_output.rtt=Segger RTT
GenRF52832.menu.debug_output.rtt.build.logger_flags=-DCFG_LOGGER=2 -DCFG_TUSB_DEBUG=CFG_DEBUG -DSEGGER_RTT_MODE_DEFAULT=SEGGER_RTT_MODE_BLOCK_IF_FIFO_FULL

#======
# -----------------------------------
# Nordic nRF52840 DK
# -----------------------------------
pca10056.name=Nordic nRF52840 DK

# VID/PID for Bootloader, Arduino & CircuitPython
pca10056.vid.0=0x239A
pca10056.pid.0=0x80DA
pca10056.vid.1=0x239A
pca10056.pid.1=0x00DA

# Upload
pca10056.bootloader.tool=bootburn
pca10056.upload.tool=nrfutil
pca10056.upload.protocol=nrfutil
pca10056.upload.use_1200bps_touch=true
pca10056.upload.wait_for_upload_port=true
pca10056.upload.maximum_size=815104
pca10056.upload.maximum_data_size=237568

# Build
pca10056.build.mcu=cortex-m4
pca10056.build.f_cpu=64000000
pca10056.build.board=NRF52840_PCA10056
pca10056.build.core=nRF5
pca10056.build.variant=pca10056
pca10056.build.usb_manufacturer="Nordic"
pca10056.build.usb_product="nRF52840 DK"
pca10056.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
pca10056.build.ldscript=nrf52840_s140_v6.ld
pca10056.build.openocdscript=scripts/openocd/daplink_nrf52.cfg
pca10056.build.vid=0x239A
pca10056.build.pid=0x80DA
pca10056.build.uf2_family=0xADA52840

# Menu: SoftDevice
pca10056.menu.softdevice.s140v6=S140 6.1.1
pca10056.menu.softdevice.s140v6.build.sd_name=s140
pca10056.menu.softdevice.s140v6.build.sd_version=6.1.1
pca10056.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Menu: Debug Level
pca10056.menu.debug.l0=Level 0 (Release)
pca10056.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
pca10056.menu.debug.l1=Level 1 (Error Message)
pca10056.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
pca10056.menu.debug.l2=Level 2 (Full Debug)
pca10056.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
pca10056.menu.debug.l3=Level 3 (Segger SystemView)
pca10056.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
pca10056.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# Menu: Debug Port
pca10056.menu.debug_output.serial=Serial
pca10056.menu.debug_output.serial.build.logger_flags=-DCFG_LOGGER=0
pca10056.menu.debug_output.serial1=Serial1
pca10056.menu.debug_output.serial1.build.logger_flags=-DCFG_LOGGER=1 -DCFG_TUSB_DEBUG=CFG_DEBUG
pca10056.menu.debug_output.rtt=Segger RTT
pca10056.menu.debug_output.rtt.build.logger_flags=-DCFG_LOGGER=2 -DCFG_TUSB_DEBUG=CFG_DEBUG -DSEGGER_RTT_MODE_DEFAULT=SEGGER_RTT_MODE_BLOCK_IF_FIFO_FULL

# -----------------------------------
# Nordic nRF52833 DK
# -----------------------------------
pca10100.name=Nordic nRF52833 DK

# VID/PID for Bootloader, Arduino & CircuitPython
pca10100.vid.0=0x239A
pca10100.pid.0=0x80D8
pca10100.vid.1=0x239A
pca10100.pid.1=0x00D8

pca10100.upload.tool=openocd
pca10100.upload.protocol=cmsis-dap
pca10100.upload.target=nrf52
pca10100.upload.maximum_size=286720
pca10100.upload.maximum_data_size=106496
pca10100.upload.setup_command=transport select swd;
pca10100.upload.use_1200bps_touch=false
pca10100.upload.wait_for_upload_port=false
pca10100.upload.native_usb=false

